
public class A04_VarNaming {

	public static void main(String[] args) {
		
/*
		 	# 우리가 변수를 사용하는 이유
		 1. 값을 한번에 변경할 수 있다.
		 2. 값에 의미를 부여할 수 있다.
		 
		 	# 변수의 작명 규칙
		 1. 두 단어 이상을 이어붙인 변수명을 사용할 때 _를 활용한다. (snake_case)
		 	ex) apple_count, minsu_age
		 2. 두 단어 이상을 이어붙인 변수명을 사용할 때 대문자를 활용한다 (camelCase)
		 	ex) appleCount, minsuAge
		 3. 변수명 첫 글자는 소문자를 사용한다.
		 
		 4. 클래스명 첫 글자는 대문자를 사용한다.
		 
		 5. 프로그램 실행도중 값이  변하지 않는 변수(상수)는 모두 대문자를 사용한다.
		 	ex) APPLE_CALORIE, PI
		 6. 변수의 용도를 추측할 수 있는 적절한 단어 사용.
		 
		 
		  	# 필수적인 변수의 작명 규칙(안지키면 에러)
		 1. 변수의 첫 번째 글자는 숫자가 될 수 없다.
		 
		 2. 변수명 사이에는 공백을 사용할 수 없다.
		 
		 3. 특수문자는 _와 $만 사용할 수 있다.
		 
		 4. 이미 사용하고 있는 키워드는 변수명으로 사용할 수 없다.
		 
		 
		 
		 
		 
*/
		
		
		
	}
}
