
public class A04_VarTypes {
	
	public static void main(String[] args) {
	
		/*
		  음수 : 2의 보수 + 1
		 - byte 0000 0000(0) ~ 0111 ~ 1111(127)
		  		1000 0000(-128) ~ 1111 1111(-1)
		 - short 0000 0000 0000 0000(0) ~ 0111 1111 1111 1111(32,767)
		  		 1000 0000 0000 0000(-32,768) ~ 1111 1111 1111 1111(-1)
		 - char 0 ~ 65535 문자코드 저장
		 - int  0 ~ 2,147,483,648
		 		-2,147,483,649 ~ -1
		 - long -2^63 ~ 2^63 - 1
		 	
		 	실수
		 - float	(4byte)
		 - double	(8byte)
		 
		 - 실수는 주로 그래픽 계산에 사용
		 - 부동 소수점 방식을 사용
		 
		 */
		
		// 정수타입 리터럴은 기본적으로 int타입이기 떄문에 
		// int타입의 범위를 벗어나는 값을 사용하고 싶다면 뒤에 l ro L 을 붙여줘야함
		long _long = 20000000000l;
		
		/*	# 참조형 타입
			- 참조형 타입은 대문자로 시작한다.
			- 소문자로 시작하는 타입은 모두 기본형 타입이라고 부른다.
			
			-String, 그 외 모든 클래스들
		
		
		*/
	}

}
